In [52]:
students_grades = {
    "name": ["Idris", "Mel", "Ibrahim", "Amin", "Nazri"],
    "math": [95, 80, 85, 94, 94],
    "english": [78, 88, 91,94, 94],
    "science": [88, 92, 79, 94,94]
}
print(students_grades)

{'name': ['Idris', 'Mel', 'Ibrahim', 'Amin', 'Nazri'], 'math': [95, 80, 85, 94, 94], 'english': [78, 88, 91, 94, 94], 'science': [88, 92, 79, 94, 94]}

In [60]:
students_grades["name"][2]

students_grades["name"][2] = "Atheerah"

students_grades["name"]

['Idris', 'Mel', 'Atheerah', 'Amin', 'Nazri']

In [29]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/mf/Library/Python/3.14/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/mf/Library/Python/3.14/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl (10.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.8/10.8 MB 3.2 MB/s  0:00:03 eta 0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [61]:
import pandas as pd

df = pd.DataFrame(students_grades)

df
print(df, "\n first table -----------------\n")
print(df, "\n") 
print(df)

       name  math  english  science
0     Idris    95       78       88
1       Mel    80       88       92
2  Atheerah    85       91       79
3      Amin    94       94       94
4     Nazri    94       94       94
 first table -----------------

       name  math  english  science
0     Idris    95       78       88
1       Mel    80       88       92
2  Atheerah    85       91       79
3      Amin    94       94       94
4     Nazri    94       94       94

       name  math  english  science
0     Idris    95       78       88
1       Mel    80       88       92
2  Atheerah    85       91       79
3      Amin    94       94       94
4     Nazri    94       94       94

In [62]:
type(df)

#numpy.ndarray

pandas.core.frame.DataFrame

In [63]:
df.head(2)
df.tail(2)

    name  math  english  science
3   Amin    94       94       94
4  Nazri    94       94       94

In [65]:
df['math'][2]

np.int64(85)

In [69]:
print(df['name'])
print(df['math'])

0       Idris
1         Mel
2    Atheerah
3        Amin
4       Nazri
Name: name, dtype: object
0    95
1    80
2    85
3    94
4    94
Name: math, dtype: int64

In [70]:
import numpy as np
arrayyyy = np.array([])
type(arrayyyy)

numpy.ndarray

In [74]:
# series

marks_series = pd.Series([1,2,3,4,5])
#type(marks_series)

print(marks_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [92]:

english_amin = df['english'][4]

print(english_amin)

94

In [94]:
at = df["name"][2]
at_english = df["english"][2]

print(f" In English {at} had {at_english} marks")

 In English Atheerah had 91 marks

In [ ]:
#core data types

#dataframe
#series

In [ ]:
temp_series = pd.Series([30,32,33,34,28])
type(temp_series)

print(temp_series)

0    30
1    32
2    33
3    34
4    28
dtype: int64

In [109]:
temp_df = pd.DataFrame(city_temp)

print(temp_df)

    cities  temp
0    Delhi    25
1   Chenai    50
2  Kashmir    -1
3      Goa    28
4   Mumbai    22

In [118]:
#series object - single columns, 1D column

temp11 = pd.Series([32,31,50,34,-2])
print("type pf temp11",type(temp11))

temperatures = {
    'cities' : ['KL','HK','SG','NY','HLS'],
    'temp10' : [23,29,40,0,5]
}

temp_df = pd.DataFrame(temperatures)
print('type of temp_df: ',type(temp_df))

print(temp_df)
print(temp11)

type pf temp11 <class 'pandas.core.series.Series'>
type of temp_df:  <class 'pandas.core.frame.DataFrame'>
  cities  temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [117]:
temp_df['temp22'] = temp11

temp_df

  cities  temp10  temp22
0     KL      23      32
1     HK      29      31
2     SG      40      50
3     NY       0      34
4    HLS       5      -2

In [120]:
data = {
    'cities' : ['KL','KL','KL','NY','HLS'],
    'temp10' : [23,29,40,0,5]
}

df = pd.DataFrame(data)
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [121]:
df['cities'].value_counts()

cities
KL     3
NY     1
HLS    1
Name: count, dtype: int64

In [122]:
df['cities'].unique()

array(['KL', 'NY', 'HLS'], dtype=object)

In [ ]:
df['cities'].duplicated()

0    False
1     True
2     True
3    False
4    False
Name: cities, dtype: bool

In [126]:
df['cities'].drop_duplicates()

0     KL
3     NY
4    HLS
Name: cities, dtype: object

In [1]:
import pandas as pd

df5 = pd.read_csv("grades.csv")
df5

      name  Idrees  Mel  Ibrahim
0    maths      96   95       94
1  english      96   95       94
2  science      96   95       94